In [2]:
import pandas as pd

In [93]:
all_df_csv = '../project-four/all_df.csv'
all_df = pd.read_csv(all_df_csv, encoding='iso-8859-1', index_col ='job_ids')

In [94]:
all_df.shape

(1459, 10)

In [95]:
all_df.head(1)

,Unnamed: 0,job_advertiser,job_title,job_class,job_sub_class,job_type,job_location,job_post_date,job_salary,job_desc
job_ids,,,,,,,,,,
36617279,0,['\n SEEK\n '],['\n Data Scientist\n ...,['\n Science & Technology\...,"['\n ', '\n ...","['<span class=""lwHBT6d"">\n F...","['<strong class=""lwHBT6d"">\n ...","['<span class=""lwHBT6d"">\n ...","['<span class=""lwHBT6d"">\n ...","['<div class=""templatetext"">\n ..."

In [96]:
# Clean job_advertiser

newAdvertisers=[]

for a in all_df.job_advertiser:
    try:
        s=a.split('\\n')[1].lstrip()
        #print(s)
        newAdvertisers.append(s)
    except:
        newAdvertisers.append('')
        
newAdvertisers[0:5]

['SEEK',
 'Morgan Consulting',
 'Ethos BeathChapman',
 'Marshall McAdam',
 'Sportsbet']

In [97]:
# Clean job_title

new_job_title = []

for b in all_df.job_title:
    try:
        t=b.split('\\n')[1].lstrip()
        
        new_job_title.append(t)
    except:
        new_job_title.append('')
        
new_job_title[0:5]

['Data Scientist',
 'Data Scientist -',
 'Data Scientist',
 'Data Scientist',
 'Data Scientist']

In [98]:
# Clean job_class

new_job_class = []

for c in all_df.job_class:
    try:
        u=c.split('\\n')[1].lstrip()
        
        new_job_class.append(u)
    except:
        new_job_class.append('')
        
new_job_class[0:5]

['Science & Technology',
 '',
 'Information & Communication Technology',
 '',
 'Science & Technology']

In [99]:
# Clean job_sub_class

new_job_sub_class = []

for d in all_df.job_sub_class:
    try:
        v=d.split('\\n')[2].lstrip()
        
        new_job_sub_class.append(v)
    except:
        new_job_sub_class.append('')
        
new_job_sub_class[0:5]

['Mathematics, Statistics & Information Sciences',
 'Networks & Systems Administration',
 'Developers/Programmers',
 'Database Development & Administration',
 'Mathematics, Statistics & Information Sciences']

In [100]:
# Clean job_type

new_job_type = []

for e in all_df.job_type:
    try:
        u=e.split('\\n')[1].lstrip()
        
        new_job_type.append(u)
    except:
        new_job_type.append('')
        
new_job_type[0:5]

['Full Time', 'Contract/Temp', 'Full Time', 'Contract/Temp', 'Full Time']

In [102]:
# Add new salary column and populate values with '150k+' or '100-150k' or below_100k' to DataFrame
all_df['salary'] = 'below_100k'

# Add new cleaned newAdvertisers column to DataFrame
all_df['advertiser'] = newAdvertisers

# Add new cleaned new_job_title column to DataFrame
all_df['title'] = new_job_title

# Add new cleaned new_job_class column to DataFrame
all_df['class'] = new_job_class

# Add new cleaned new_job_sub_class column to DataFrame
all_df['sub_class'] = new_job_sub_class

# Add new cleaned new_job_type column to DataFrame
all_df['type'] = new_job_type

In [104]:
all_df.columns

Index(['Unnamed: 0', 'job_advertiser', 'job_title', 'job_class',
       'job_sub_class', 'job_type', 'job_location', 'job_post_date',
       'job_salary', 'job_desc', 'salary', 'advertiser', 'title', 'class',
       'sub_class', 'type'],
      dtype='object')

In [105]:
# Drop columns that are no longer required from DataFrame

all_df.drop(all_df.iloc[:, 0:9], inplace=True, axis=1)

In [106]:
# Inspect columns and shape for all_df

print(all_df.columns)
print(all_df.shape)
all_df.head(1)

Index(['job_desc', 'salary', 'advertiser', 'title', 'class', 'sub_class',
       'type'],
      dtype='object')
(1459, 7)

,job_desc,salary,advertiser,title,class,sub_class,type
job_ids,,,,,,,
36617279,"['<div class=""templatetext"">\n ...",below_100k,SEEK,Data Scientist,Science & Technology,"Mathematics, Statistics & Information Sciences",Full Time

In [190]:
### Repeat the above steps from the start but apply to the other CSVs (med_df.csv, high_df.csv)

In [92]:
# Inspect columns and shape for med_df

print(med_df.columns)
print(med_df.shape)
med_df.head(1)

Index(['job_desc', 'salary', 'advertiser', 'title', 'class', 'sub_class',
       'type'],
      dtype='object')
(1286, 7)

,job_desc,salary,advertiser,title,class,sub_class,type
job_ids,,,,,,,
36617279,"['<div class=""templatetext"">\n ...",100-150k,SEEK,Data Scientist,Science & Technology,"Mathematics, Statistics & Information Sciences",Full Time

In [80]:
# Inspect columns and shape for high_df

print(high_df.columns)
print(high_df.shape)
high_df.head(1)

Index(['job_desc', 'salary', 'advertiser', 'title', 'class', 'sub_class',
       'type'],
      dtype='object')
(664, 7)

,job_desc,salary,advertiser,title,class,sub_class,type
job_ids,,,,,,,
36823796,"['<div class=""templatetext"">\n ...",150k+,Morgan Consulting,Data Scientist -,,Networks & Systems Administration,Contract/Temp

In [114]:
# Remove duplicate rows from all DataFrames

all_df.drop_duplicates(keep='first', inplace=True)
med_df.drop_duplicates(keep='first', inplace=True)
high_df.drop_duplicates(keep='first', inplace=True)

print(all_df.shape)
print(med_df.shape)
print(high_df.shape)

(846, 7)
(682, 7)
(332, 7)

In [54]:
### The following steps are to merge DataFrames - all_df, med_df and high_df and ensuring duplicates are removed ###

In [115]:
# Create a low_df DataFrame where the job_ids exists in all_df but are not in med_df

low_df = all_df.loc[all_df.index.difference(med_df.index) ]

In [116]:
low_df.shape

(278, 7)

In [117]:
# Create a medium_df DataFrame where the job_ids exists in med_df but are not in high_df

medium_df = med_df.loc[med_df.index.difference(high_df.index) ]

In [118]:
medium_df.shape

(449, 7)

In [119]:
high_df.shape

(332, 7)

In [122]:
# Concatenate all DataFrames vertifically

jobs_df = pd.concat([low_df, medium_df, high_df], axis=0)

In [123]:
jobs_df.shape

(1059, 7)

In [124]:
# Save jobs_df to csv
jobs_df.to_csv('C:/Users/Georgie/Desktop/DSI/project-four/jobs_df.csv')

In [442]:
## The end - please refer to Part 3 notebook